---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.Flipped
source: html/03bbec45-65f4-7770-1278-2f16e1d101b5.htm
---
# Autodesk.Revit.DB.DividedPath.Flipped Property

If the divided path is flipped the nodes are numbered in the reverse order.
 It also switches the ends from which beginningIndent and endIndent are measured from.

## Syntax (C#)
```csharp
public bool Flipped { get; }
```